Revit 2027 API
BuiltInFailures.RoofFailures.CurveRoofSkippedLoopsWarn Property
 Some loops were skipped
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurveRoofSkippedLoopsWarn { get; }
Public Shared ReadOnly Property CurveRoofSkippedLoopsWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurveRoofSkippedLoopsWarn {
	FailureDefinitionId^ get ();
}
static member CurveRoofSkippedLoopsWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace